# Grouping	&	Aggregation	in	Pandas

In [46]:
import pandas as pd

In [47]:
data = {
    'Department': ['HR', 'Finance', 'IT', 'HR', 'IT', 'Finance', 'HR', 'IT', 'IT'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Salm', 'Adom'],
    'Salary': [5000, 6000, 7000, 5200, 7500, 6400, 5500, 6600, 7250],
    'Experience': [3, 4, 5, 2, 6, 5, 3, 3, 7]
}

df = pd.DataFrame(data)
df

  Department Employee  Salary  Experience
0         HR    Alice    5000           3
1    Finance      Bob    6000           4
2         IT  Charlie    7000           5
3         HR    David    5200           2
4         IT      Eve    7500           6
5    Finance    Frank    6400           5
6         HR    Grace    5500           3
7         IT     Salm    6600           3
8         IT     Adom    7250           7

In [48]:
grouped_df = df.groupby('Department')
grouped_df

In [49]:
grouped_df.sum()

                      Employee  Salary  Experience
Department
Finance               BobFrank   12400           9
HR             AliceDavidGrace   15700           8
IT          CharlieEveSalmAdom   28350          21

Bob     Boank

In [50]:
ord('b'), ord('a')

(98, 97)

In [51]:
grouped_df.max()

           Employee  Salary  Experience
Department
Finance       Frank    6400           5
HR            Grace    5500           3
IT             Salm    7500           7

In [52]:
grouped_df['Salary']

In [53]:
grouped_df[['Salary']]

In [54]:
grouped_df['Salary'].sum()

Department
Finance    12400
HR         15700
IT         28350
Name: Salary, dtype: int64

In [55]:
grouped_df['Experience'].min()

Department
Finance    4
HR         2
IT         3
Name: Experience, dtype: int64

In [56]:
grouped_df.agg({
    'Salary':['sum', 'mean', 'min', 'max'],
    'Experience': ['median', 'std', 'max', 'min']
})

           Salary                          Experience
              sum         mean   min   max     median       std max min
Department
Finance     12400  6200.000000  6000  6400        4.5  0.707107   5   4
HR          15700  5233.333333  5000  5500        3.0  0.577350   3   2
IT          28350  7087.500000  6600  7500        5.5  1.707825   7   3

Range = Maximum value - minimum value

In [57]:
def calc_range(x):
    return x.max() - x.min()

grouped_df['Salary'].agg(calc_range)

Department
Finance    400
HR         500
IT         900
Name: Salary, dtype: int64

In [58]:
grouped_df.agg({
    'Salary':['sum', 'mean', 'min', 'max', calc_range],
    'Experience': ['median', 'std', 'max', 'min']
})

           Salary                                     Experience            \
              sum         mean   min   max calc_range     median       std
Department
Finance     12400  6200.000000  6000  6400        400        4.5  0.707107
HR          15700  5233.333333  5000  5500        500        3.0  0.577350
IT          28350  7087.500000  6600  7500        900        5.5  1.707825


           max min
Department
Finance      5   4
HR           3   2
IT           7   3

In [59]:
grouped_df.filter(lambda x: len(x) > 2)

  Department Employee  Salary  Experience
0         HR    Alice    5000           3
2         IT  Charlie    7000           5
3         HR    David    5200           2
4         IT      Eve    7500           6
6         HR    Grace    5500           3
7         IT     Salm    6600           3
8         IT     Adom    7250           7

In [60]:
grouped_df.filter(lambda x: len(x) == 2)

  Department Employee  Salary  Experience
1    Finance      Bob    6000           4
5    Finance    Frank    6400           5

In [61]:
df['Salary Expanded'] = df['Salary'].expanding().sum()
df

  Department Employee  Salary  Experience  Salary Expanded
0         HR    Alice    5000           3           5000.0
1    Finance      Bob    6000           4          11000.0
2         IT  Charlie    7000           5          18000.0
3         HR    David    5200           2          23200.0
4         IT      Eve    7500           6          30700.0
5    Finance    Frank    6400           5          37100.0
6         HR    Grace    5500           3          42600.0
7         IT     Salm    6600           3          49200.0
8         IT     Adom    7250           7          56450.0

In [62]:
df['Experience'].unique()

array([3, 4, 5, 2, 6, 7], dtype=int64)

In [63]:
df['Department'].unique()

array(['HR', 'Finance', 'IT'], dtype=object)

In [65]:
df

  Department Employee  Salary  Experience  Salary Expanded
0         HR    Alice    5000           3           5000.0
1    Finance      Bob    6000           4          11000.0
2         IT  Charlie    7000           5          18000.0
3         HR    David    5200           2          23200.0
4         IT      Eve    7500           6          30700.0
5    Finance    Frank    6400           5          37100.0
6         HR    Grace    5500           3          42600.0
7         IT     Salm    6600           3          49200.0
8         IT     Adom    7250           7          56450.0

In [66]:
df[df['Experience'] == 3]

  Department Employee  Salary  Experience  Salary Expanded
0         HR    Alice    5000           3           5000.0
6         HR    Grace    5500           3          42600.0
7         IT     Salm    6600           3          49200.0

In [68]:
df.pivot_table(values='Salary', index='Department', columns='Experience', aggfunc='mean')

Experience       2       3       4       5       6       7
Department
Finance        NaN     NaN  6000.0  6400.0     NaN     NaN
HR          5200.0  5250.0     NaN     NaN     NaN     NaN
IT             NaN  6600.0     NaN  7000.0  7500.0  7250.0

In [69]:
df.pivot_table(values='Salary', index='Department', columns='Experience', aggfunc='min')

Experience       2       3       4       5       6       7
Department
Finance        NaN     NaN  6000.0  6400.0     NaN     NaN
HR          5200.0  5000.0     NaN     NaN     NaN     NaN
IT             NaN  6600.0     NaN  7000.0  7500.0  7250.0

In [70]:
df.pivot_table(values='Salary', index='Department', columns='Experience', aggfunc='mean')

Experience       2       3       4       5       6       7
Department
Finance        NaN     NaN  6000.0  6400.0     NaN     NaN
HR          5200.0  5250.0     NaN     NaN     NaN     NaN
IT             NaN  6600.0     NaN  7000.0  7500.0  7250.0